{"id":"chevening-pakistan","steps":["Check eligibility (work-experience ≥2 years, return-to-Pakistan rule).","Choose up to 3 UK master’s courses and note their deadlines.","Create/apply on Chevening portal; complete profile, essays, and preferences.","Add two referees (they upload later).","Submit application (usually by Nov).","If longlisted, take interview at British High Commission; upload references.","Once selected, secure unconditional university offer, complete visa/ATAS if needed.","Arrive in the UK as per award instructions."]}
{"id":"commonwealth-uk","steps":["Identify the CSC stream (Master’s/PhD) that fits your profile.","Prepare documents (transcripts, statement, refs, passport).","Apply on CSC portal for your chosen scheme.","Apply via HEC Pakistan (nominating agency) and upload required docs.","Submit both apps before their respective deadlines.","Await HEC nomination + CSC outcome; respond to requests (refs/medical).","If selected, accept award, arrange visa, and travel as instructed."]}
{"id":"stipendium-hungaricum","steps":["Review eligible Hungarian programs and quotas for Pakistan.","Create DreamApply account and fill application.","Prepare docs (transcripts, passport, language proof/statement).","Submit DreamApply application before the call closes.","Apply via HEC nomination portal for Pakistan (if required that year).","Take any interviews/tests requested by host institutions.","If placed, accept offer, complete medical/visa steps, and travel."]}
{"id":"csc-china","steps":["Choose universities/majors; confirm they accept CSC Type A (Bilateral).","Create CSC application (select Agency No. for Pakistan/Bilateral).","Prepare notarized degrees/transcripts, medical form, research plan, refs.","Submit CSC online form and print/download PDF.","Apply on HEC portal (Pakistan nominating agency) and upload CSC forms.","Attend any interviews/verification requested by HEC/Embassy.","If awarded, complete visa (X1/X2), medical, and departure formalities."]}
{"id":"turkiye-scholarships","steps":["Create account on Türkiye Bursları portal during Jan–Feb window.","Fill profile (education, activities), select programs, and upload docs.","Write statement of purpose; check preferences and submit.","If shortlisted, attend interview (online/in-person).","Receive placement; accept offer and placement university.","Apply for Turkish student visa; arrange accommodation and travel.","Complete registration at university and Turkish residence permit."]}
{"id":"daad-germany","steps":["Use DAAD database to find the right program (e.g., EPOS).","Check program-specific requirements (language, experience, docs).","Contact host (if research grant) for supervision/acceptance where needed.","Create DAAD portal account or apply via program website as instructed.","Upload docs (CV, motivation, refs, language proof, degree transcripts).","Submit by the program’s deadline (often Aug–Oct for EPOS).","If selected, follow visa/insurance/enrolment steps; travel to Germany."]}
{"id":"canada-cgrs-d","steps":["Confirm your target Canadian institution participates in CGRS-D.","Review agency stream (CIHR/NSERC/SSHRC) matching your research area.","Prepare research proposal, CV, transcripts, and referee assessments.","Follow your department/grad school internal nomination timeline.","Submit in the correct online system/portal per the agency instructions.","Institution ranks/forwards to national competition; await results.","If awarded, accept terms, finalize admission, and begin program."]}
{"id":"australia-awards","steps":["Open the Pakistan country page; read the current intake guide.","Confirm eligibility and priority fields; check English requirements.","Register in OASIS (or specified portal) and start application.","Prepare docs (degrees, CV, refs, employment evidence).","Submit before the Pakistan-specific deadline.","If shortlisted, attend assessment/interview; complete medical/security.","If selected, accept award, get student visa, and arrange travel."]}
{"id":"world-bank-jjwbgsp","steps":["Identify eligible participating master’s programs and secure an admission (conditional/unconditional as required).","Gather employment proof (min. professional experience), transcripts, and refs.","Apply during the relevant JJ/WBGSP window (some programs have earlier windows).","Submit all docs in the World Bank system; ensure program eligibility.","Await selection; respond to any clarification requests.","If awarded, accept scholarship, finalize admission/visa, and enroll."]}
{"id":"erasmus-mundus","steps":["Browse the official EMJM catalogue and shortlist courses.","Open each course site for exact criteria, docs, and deadlines.","Prepare a single application per course (motivation, refs, transcripts, passport, English proof).","Submit on the course website before the scholarship deadline (often Dec–Jan).","If selected, accept the scholarship/place; follow consortium instructions.","Apply for the visa(s) for first host country and plan mobility path."]}
{"id":"belgium-master-mind","steps":["Choose a Flemish institution/program and apply for admission.","Request to be considered for Master Mind; follow the host’s internal steps.","If nominated, you’ll receive instructions for the Mobility-Online application.","Complete Mobility-Online form and upload required documents.","Await selection by the Government of Flanders; accept if awarded.","Finalize admission/visa at the host institution."]}
{"id":"romania-govt","steps":["Create an account on the Study in Romania scholarship platform.","Fill personal/academic data; select degree level and preferred institutions.","Upload required docs (transcripts, passport, motivation, language).","Submit application before the MFA deadline (usually Q1).","Await results; accept if selected.","Apply for visa, arrange accommodation, and enroll on arrival."]}
{"id":"france-eiffel","steps":["Identify a French university and program early (months before call).","Email program/international office requesting Eiffel nomination.","If the university agrees, provide dossier per their internal cutoff.","University compiles/submits your application to Campus France.","Await results; if selected, follow Campus France and host instructions.","Complete visa (via VFS/consulate), housing, and enrollment steps."]}
{"id":"finland-scholarships","steps":["Pick target Finnish universities/programs; check scholarship pages.","Apply via each university’s admissions portal (select scholarship option).","Upload required docs and English test results (if applicable).","Meet program/university deadlines (often Dec–Jan for autumn intake).","Await admission + scholarship result; accept offers.","Apply for residence permit (Migri) and arrange housing/travel."]}
{"id":"mext-japan","steps":["Watch Embassy of Japan in Pakistan page for the annual call.","Choose category (Undergrad/Research/Teacher Training, etc.).","Prepare docs; sit written tests (language/subject) if required.","Attend interview at the Embassy (if shortlisted).","If recommended, complete placement/university matching by MEXT.","Apply for visa and complete pre-departure formalities."]}
{"id":"gks-korea","steps":["Read the annual NIIED guidelines; choose Embassy or University track.","Confirm Pakistan quota and eligible universities/fields.","Prepare notarized/apostilled docs, transcripts, research/study plan, refs.","Submit to Embassy of Korea (Islamabad) or directly to the university.","Attend interviews; track 1st–3rd round results per track.","If selected, apply for visa, complete medical, and attend the Korean language year (if assigned)."]}
{"id":"hec-pakistan","steps":["Create/verify your profile on HEC scholarship portal.","Monitor ‘Open Scholarships’ (national & overseas) and select a scheme.","Review eligibility, required tests (HAT/GAT), domicile/province rules.","Upload documents and submit application before the scheme deadline.","Sit any required test/interview; track application status.","If selected, follow HEC award/placement and visa (if overseas)."]}